app/views/welcome/allusers.html.erb

SELECT "users".* FROM "users"
---
    <% i = 0 %>
    <% x=User.all %>