app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "asd"], ["user_id", 2], ["created_at", "2017-06-30 16:45:28.534664"], ["updated_at", "2017-06-30 16:45:28.534664"]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "Hello. Looking for a Group"], ["updated_at", "2017-07-01 19:25:41.001718"], ["id", 9]]